tarosay/arduino_core_ch32/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board Version Select
menu.clock=Clock Select
menu.usb=USB
menu.xserial=U(S)ART support
menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method
menu.pwm=PWM


##############################################################################
## HID ProMicro CH32V003

CH32V003.name=HID ProMicro CH32V003
CH32V003.build.core=arduino
CH32V003.build.board=CH32V003F4
CH32V003.upload.maximum_size=0
CH32V003.upload.maximum_data_size=0
CH32V003.build.variant_h=variant_{build.board}.h
CH32V003.build.ldscript=generated_ch32fun.ld
CH32V003.debug.tool=gdb-WCH_LinkE

# Board Version
CH32V003.menu.pnum.V14=V1.4
CH32V003.menu.pnum.V14.node=NODE_V003F4
CH32V003.menu.pnum.V14.upload.maximum_size=16384
CH32V003.menu.pnum.V14.upload.maximum_data_size=2048
CH32V003.menu.pnum.V14.build.mcu=QingKe-V2A
CH32V003.menu.pnum.V14.build.board=CH32V003F4
CH32V003.menu.pnum.V14.build.series=CH32V00x
CH32V003.menu.pnum.V14.build.variant=CH32V00x/CH32V003F4
CH32V003.menu.pnum.V14.build.chip=CH32V003F4
CH32V003.menu.pnum.V14.build.extra_flags=-DCH32V003 -DCPLUSPLUS
CH32V003.menu.pnum.V14.build.march=rv32ec
CH32V003.menu.pnum.V14.build.mabi=ilp32e
CH32V003.menu.pnum.V14.build.math_lib_gcc=-lm
CH32V003.menu.pnum.V14.build.IQ_math_RV32=
CH32V003.menu.pnum.V14.build.ch_extra_lib=

# Upload method
CH32V003.menu.upload_method.minichlink=minichlink
CH32V003.menu.upload_method.minichlink.upload.protocol=
CH32V003.menu.upload_method.minichlink.upload.options=
CH32V003.menu.upload_method.minichlink.upload.tool=minichlink
CH32V003.menu.upload_method.uiapflash=UIAPduino (USB)
CH32V003.menu.upload_method.uiapflash.upload.protocol=
CH32V003.menu.upload_method.uiapflash.upload.options=
CH32V003.menu.upload_method.uiapflash.upload.tool=uiapflash
CH32V003.menu.upload_method.swdMethod=WCH-SWD
CH32V003.menu.upload_method.swdMethod.upload.protocol=
CH32V003.menu.upload_method.swdMethod.upload.options=
CH32V003.menu.upload_method.swdMethod.upload.tool=WCH_linkE
CH32V003.menu.upload_method.ispMethod=WCH-ISP
CH32V003.menu.upload_method.ispMethod.upload.protocol=
CH32V003.menu.upload_method.ispMethod.upload.options=
CH32V003.menu.upload_method.ispMethod.upload.tool=wchisp

# Clock
CH32V003.menu.clock.48MHz_HSI=48MHz Internal
CH32V003.menu.clock.48MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSI=48000000 -DF_CPU=48000000
CH32V003.menu.clock.24MHz_HSI=24MHz Internal
CH32V003.menu.clock.24MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_24MHz_HSI=24000000 -DF_CPU=24000000

# USB (default: WebHID Only — no flag needed, see usb_config.h)
CH32V003.menu.usb.webhid=WebHID Only
CH32V003.menu.usb.webhid.build.flags.usb=-DUIAP_WEBHID_ONLY
CH32V003.menu.usb.kbd=Keyboard+Mouse
CH32V003.menu.usb.kbd.build.flags.usb=-DUIAP_COMPOSITE_HID
CH32V003.menu.usb.kbdweb=Keyboard+Mouse+WebHID
CH32V003.menu.usb.kbdweb.build.flags.usb=-DUIAP_COMPOSITE_HID -DUIAP_WEBHID
CH32V003.menu.usb.terminal=Terminal HID
CH32V003.menu.usb.terminal.build.flags.usb=-DUIAP_USB_TERMINAL
CH32V003.menu.usb.nousb=No USB (SD log / UART only)
CH32V003.menu.usb.nousb.build.flags.usb=-DUIAP_NO_USB

# PWM (PWMmin library TIM2 mapping)
# TIM1 pins (0/5/6/12) are always available regardless of this setting.
CH32V003.menu.pwm.default=TIM2 Default (pin 2 / PC0)
CH32V003.menu.pwm.default.build.flags.pwm=
CH32V003.menu.pwm.remap3=TIM2 Remap3 (pins 9/15/16)
CH32V003.menu.pwm.remap3.build.flags.pwm=-DPWMMIN_TIM2_REMAP3

# U(S)ART / HardwareSerial
# Note: HardwareSerial uses USART1 (TX=PD5, RX=PD6).
#       Costs +4,748 B Flash even if Serial is never called.
#       Use UIAPSerial (lightweight wrapper) for Flash-sensitive sketches.
CH32V003.menu.xserial.none=None (use UIAPSerial)
CH32V003.menu.xserial.none.build.flags.serial=
CH32V003.menu.xserial.uart1=HardwareSerial (Serial / USART1)
CH32V003.menu.xserial.uart1.build.flags.serial=-DSERIAL_UART_INSTANCE=1

# Optimize (LTO always enabled — required for 16KB Flash)
CH32V003.menu.opt.oslto=Smallest (-Os) with LTO
CH32V003.menu.opt.oslto.build.flags.optimize=-Os -flto
CH32V003.menu.opt.o1lto=Fast (-O1) with LTO
CH32V003.menu.opt.o1lto.build.flags.optimize=-O1 -flto
CH32V003.menu.opt.o2lto=Faster (-O2) with LTO
CH32V003.menu.opt.o2lto.build.flags.optimize=-O2 -flto
CH32V003.menu.opt.o3lto=Fastest (-O3) with LTO
CH32V003.menu.opt.o3lto.build.flags.optimize=-O3 -flto

# Debug information
CH32V003.menu.dbg.none=None
CH32V003.menu.dbg.none.build.flags.debug=-DNDEBUG
CH32V003.menu.dbg.enable_sym=Symbols Enabled (-g)
CH32V003.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG

# C Runtime Library
CH32V003.menu.rtlib.none=None (ch32fun)
CH32V003.menu.rtlib.none.build.flags.ldflags=
CH32V003.menu.rtlib.nano=Newlib Nano
CH32V003.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs


##############################################################################
## UIAPduino Pro Micro CH32V006
## Based on upstream openwch CH32VM00X_EVT (CH32V006K8).

CH32V006.name=UIAPduino Pro Micro CH32V006
CH32V006.build.core=arduino
CH32V006.build.board=CH32V006K8
CH32V006.upload.maximum_size=0
CH32V006.upload.maximum_data_size=0
CH32V006.build.variant_h=variant_{build.board}.h
CH32V006.build.ldscript=generated_ch32fun.ld
CH32V006.build.flags.usb=-DUIAP_NO_USB
CH32V006.debug.tool=gdb-WCH_LinkE

# Board Version
CH32V006.menu.pnum.V11=V1.1
CH32V006.menu.pnum.V11.node=NODE_V006K8
CH32V006.menu.pnum.V11.upload.maximum_size=63488
CH32V006.menu.pnum.V11.upload.maximum_data_size=8192
CH32V006.menu.pnum.V11.build.mcu=QingKe-V2C
CH32V006.menu.pnum.V11.build.board=CH32V006K8
CH32V006.menu.pnum.V11.build.series=CH32VM00X
CH32V006.menu.pnum.V11.build.variant=CH32VM00X/CH32V006K8
CH32V006.menu.pnum.V11.build.chip=CH32V006K8
CH32V006.menu.pnum.V11.build.march=rv32ec_zmmul
CH32V006.menu.pnum.V11.build.mabi=ilp32e
CH32V006.menu.pnum.V11.build.math_lib_gcc=-lm
CH32V006.menu.pnum.V11.build.IQ_math_RV32=
CH32V006.menu.pnum.V11.build.ch_extra_lib=

# Upload method
CH32V006.menu.upload_method.minichlink=minichlink
CH32V006.menu.upload_method.minichlink.upload.protocol=
CH32V006.menu.upload_method.minichlink.upload.options=
CH32V006.menu.upload_method.minichlink.upload.tool=minichlink

# Clock
CH32V006.menu.clock.48MHz_HSI=48MHz Internal
CH32V006.menu.clock.48MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSI=48000000 -DF_CPU=48000000

# Optimize
CH32V006.menu.opt.osstd=Smallest (-Os default)
CH32V006.menu.opt.osstd.build.flags.optimize=-Os
CH32V006.menu.opt.oslto=Smallest (-Os) with LTO
CH32V006.menu.opt.oslto.build.flags.optimize=-Os -flto

# Debug information
CH32V006.menu.dbg.none=None
CH32V006.menu.dbg.none.build.flags.debug=-DNDEBUG
CH32V006.menu.dbg.enable_sym=Symbols Enabled (-g)
CH32V006.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG

# C Runtime Library
CH32V006.menu.rtlib.nano=Newlib Nano (default)
CH32V006.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
